ProRT3_38313203/app/Controllers/Usuario_controller.php

        public function listado_usuario(){
            $consulta_model = new Usuario_model();
            $datos['usuario'] = $consulta_model->orderBy('id_usuario','asc')->findAll();
---
SELECT *
FROM `usuario`
ORDER BY `id_usuario` ASC

        public function editarUsuario($id_usuario) {

            // Validar entrada
            $input = $this->validate([
                'nombre' => 'required',
                'apellido' => 'required',
                'email' => 'required',

            ]);

            $UsuarioModel = new Usuario_model();

            if (!$input) {

                $data['titulo'] = 'Editar usuario';
                $dato['usuario'] = $UsuarioModel->where('id_usuario', $id_usuario)->first();
---
SELECT *
FROM `usuario`
WHERE `id_usuario` = '4'
 LIMIT 1